/**
 * Набор тестов для объекта "validator" 
 * autor Komarov Artem 
 * site : http://php-zametki.ru
 * email: arty-komarov@yandex.ru
 */

/**
 * Проверка ввода русских букв и пробелов:
 */
validator.tests.ru_char = {
	failText  : "Допустимы только русские буквы и пробелы.",
	condition : /^[а-яё\s]+$/i
};
/**
 * Проверка ввода латинских букв и пробелов:
 */
validator.tests.en_char = {
	failText  : "Допустимы только английские буквы и пробелы.",
	condition : /^[a-z\s]+$/i
};
/**
 * Проверка ввода целых чисел:
 */
validator.tests.integer =  {
	failText  : "Допустимы целые чила.",
	condition : /^\b\d+$/
};
/**
 * Проверка ввода целых, вещественных, положительных и отрицательных чисел:
 */
validator.tests.numeric  =  {
	failText  : "Допустимы целые и веществ. чила.",
	condition : /^[\-+]?\b[0-9]*\.?[0-9]+$/
};
/**
 * Заимствовано из библиотеки программы RegexBuddy: http://www.regexbuddy.com/
 * Проверка ввода email:
 */
validator.tests.email   =  {
	failText  : "Допустим только валидный email адрес.",
	condition : /\b[A-Z0-9-._%+]+@[A-Z0-9-.]+\.[A-Z]{2,4}\b/i
};
/**
 * Проверка заполнения, пробелы учитываются:
 */
validator.tests.require =  {
	failText  : "Обязательное поле.",
	condition : /^.+$/im
	//condition : /[\u0020-\u007d\u0410-\u0451]+/i
	//condition : /[\wа-яё]+/i
};
/**
 * Проверка заполнения, пробелы не учитываются:
 */
validator.tests.require_ws =  {
	failText  : "Обязательное поле без учёта пробелов.",
	condition : /[\u0021-\u007d\u0410-\u0451]+/im
	//condition : /[\wа-яё]+/i
};
/**
 * Заимствовано из библиотеки программы RegexBuddy: http://www.regexbuddy.com/
 * IPv4-адрес (точный захват)
 * Захват с 0.0.0.0 по 255.255.255.255
 */
validator.tests.ipv4 = {
	failText  : "Не правильный формат IP v4.",
	condition : /\b(25[0-5]|2[0-4][0-9]|1[0-9][0-9]|[1-9]?[0-9])\.(25[0-5]|2[0-4][0-9]|1[0-9][0-9]|[1-9]?[0-9])\.(25[0-5]|2[0-4][0-9]|1[0-9][0-9]|[1-9]?[0-9])\.(25[0-5]|2[0-4][0-9]|1[0-9][0-9]|[1-9]?[0-9])\b/
};
/**
 * Заимствовано из библиотеки программы RegexBuddy: http://www.regexbuddy.com/
 * Проверка доменного имени:
 */
validator.tests.domain =  {
	failText  : "Не правильное доменное имя.",
	condition : /^([a-z0-9]+(-[a-z0-9]+)*\.)+[a-z]{2,}$/i
	//condition : /[\wа-яё]+/i
};
/*
 * Заимствовано из библиотеки программы RegexBuddy: http://www.regexbuddy.com/
 * Кредитные карты: Все основные кредитные карты.
 * Проверка правильности номера кредитных карт, цифры которых могут быть сгруппированы в логические блоки, 
 * и разделяться пробелами или тире или не разделяться. 
 */
validator.tests.cred_card =  {
	failText  : "Не правильный номер карты.",
	condition : /^(?:4\d{3}[ -]*\d{4}[ -]*\d{4}[ -]*\d(?:\d{3})?|5[1-5]\d{2}[ -]*\d{4}[ -]*\d{4}[ -]*\d{4}|6(?:011|5[0-9]{2})[ -]*\d{4}[ -]*\d{4}[ -]*\d{4}|3[47]\d{2}[ -]*\d{6}[ -]*\d{5}|3(?:0[0-5]|[68][0-9])\d[ -]*\d{6}[ -]*\d{4}|(?:2131|1800)[ -]*\d{6}[ -]*\d{5}|35\d{2}[ -]*\d{4}[ -]*\d{4}[ -]*\d{4})$/
	//condition : /[\wа-яё]+/i
};